public class Task4 {
    //В списке все элементы различны. Поменяйте местами минимальный и
    // максимальный элемент этого списка.
    //(Эта задача разделяется на 3 действия:
    //Найти минимальн. значение
    //найти максим.значение
    //Поменять местами)
    //Примеры
    //входные данные
    //3 4 5 2 1
    //выходные данные
    //3 4 1 2 5

    //1. Создать класс Rondom
    //2. Создать коллекцию лист
    //3. Создать цикл j < 100 раз (добавить рондомные числа в лист add)
    //4. Создать цикл i < value.size(); i++) и сравнить одно значение с каждым значением между собой
    //5. Создать условие (если минимальное значение нужно сравнить два значения или
    // , если
}
