public class Task12 {
    //Дано натуральное число N. Найти сумму цифр числа, вычисляющую сумму цифр числа N.
    //
    //Входные данные
    //Задано единственное число N
    //
    //Выходные данные
    //Необходимо вывести  сумму цифр числа N.
    //
    //Примеры
    //входные данные
    //12
    //выходные данные
    //3
    //1. Для двух значных чисел, чтобы найти десятки нужно число поделить на 10
    //2. Чтобы найти единицы, нужно взять остаток от деления число на 10 (27 % 10 = 7)
    //3. Для трех значных чисел, чтобы найти сотни нужно разделить на 100
    //4. Чтобы найти единицы, нужно взять остаток от деления число на 10 (267 % 10 = 7)
    //5. Чтобы найти десятки, нужно взять остаток от деления число на 10 (267 / 10 % 10 = 6)
    //6. Сделать проверку на числа if число > 99, то трехзначное писать перед условием на числа

    //х - двухзначное число
    //десятки = х / 10
    //единицы = х % 10

    //х - трехзначное число
    //сотни = х / 100
    //десятки = х / 10 % 10
    //единицы = х % 10

    public static void main(String[] args) {

    }


}
